-- 1️⃣ 💰 Финансовый отчет (Прибыль vs Расходы)
docker exec -it logistics_postgres psql -U logistics_admin -d logistics_5nf -c "
SELECT 
    (SELECT COALESCE(SUM(сумма_руб), 0) FROM платежи WHERE статус_платежа = 'оплачен') AS доход_руб,
    (SELECT COALESCE(SUM(стоимость_руб), 0) FROM расходы_топлива) AS расход_топливо,
    (SELECT COALESCE(SUM(стоимость_руб), 0) FROM техническое_обслуживание) AS расход_ремонт,
    (
        (SELECT COALESCE(SUM(сумма_руб), 0) FROM платежи WHERE статус_платежа = 'оплачен') - 
        (SELECT COALESCE(SUM(стоимость_руб), 0) FROM расходы_топлива) - 
        (SELECT COALESCE(SUM(стоимость_руб), 0) FROM техническое_обслуживание)
    ) AS чистая_прибыль;
"

-- 2️⃣ 📦 Статус доставки грузов (Сводка)
docker exec -it logistics_postgres psql -U logistics_admin -d logistics_5nf -c "
SELECT 
    sz.наименование AS статус,
    COUNT(g.ид_груз) AS количество,
    ROUND(COUNT(g.ид_груз) * 100.0 / (SELECT COUNT(*) FROM грузы), 1) || '%' AS процент
FROM грузы g
JOIN статусы_заказов sz ON g.ид_статус = sz.ид_статус
GROUP BY sz.наименование
ORDER BY количество DESC;
"


-- 3
docker exec -it logistics_postgres psql -U logistics_admin -d logistics_5nf -c "
SELECT 
    v.фамилия || ' ' || v.имя AS водитель,
    t.госномер,
    COUNT(gis.ид_груз) AS перевезено_грузов
FROM водители v
JOIN транспортные_средства t ON v.ид_водитель = t.ид_водитель
JOIN груз_и_средства gis ON t.ид_средство = gis.ид_средство
GROUP BY v.ид_водитель, t.госномер
ORDER BY перевезено_грузов DESC
LIMIT 5;
"
